{
  "posts": [
    {
      "id": "1",
      "title": "json-server",
      "userId": "1"
    },
    {
      "id": "2",
      "title": "json-server",
      "userId": "2"
    }
  ],
  "comments": [
    {
      "id": "1",
      "text": "Brother, I understand you. This digital jungle is annoying sometimes. But in the end, your code creates impressive things. Go ahead, you can do it!",
      "articleId": "1",
      "userId": "1"
    },
    {
      "id": "2",
      "text": "What a hellish place? The design of the site is out of rhythm, the information is unclear, and navigation is a nightmare. Some kind of mess, not for men!",
      "articleId": "1",
      "userId": "2"
    },
    {
      "id": "3",
      "text": "Omg, is this a fake Facebook Post? Damn it looks so real! Start building your own. Use the settings to the left to begin - You can also add comments & emoticons Wink",
      "articleId": "1",
      "userId": "3"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "Nastya Polnuy lox",
      "id": "KpqHQqL"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "jhgbjhkgkjgugui",
      "id": "c-b8CR2"
    },
    {
      "articleId": "4",
      "userId": "1",
      "text": "Почему в мои рекомендациях та же самая статья, а?",
      "id": "Pp64r1W"
    },
    {
      "articleId": "2",
      "userId": "1",
      "text": "React крутоооой!!!! ООООО",
      "id": "fDXYTef"
    }
  ],
  "articles": [
    {
      "id": "1",
      "title": "Что было добавлено в ECMAScript в 2023 году",
      "subtitle": "Рассказываем, что было добавлено в ECMAScript в 2023 году. Это стандарт JavaScript, который устанавливает правила и синтаксис JS-кода. Вот, какие функции были добавлены...",
      "img": "https://www.leixue.com/uploads/2019/06/ECMAScript.png",
      "views": 1022,
      "createdAt": "22 Nov 2023",
      "userId": "1",
      "type": [
        "IT",
        "Frontend",
        "JavaScript"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Вступление",
          "paragraphs": [
            "ECMAScript – это стандарт языка программирования JavaScript, который устанавливает правила, синтаксис и другие критерии создания JavaScript-кода.",
            "ECMAScript ежегодно дополняется сообществом разработчиков JavaScript и соответствует стандартам ECMA International. Самые последние обновления ECMAScript включают в себя новые функции и методы, которые помогают разработчикам писать более гибкий и мощный код.",
            "Эти обновления позволяют создавать более качественные и быстрые веб-приложения, а также обеспечивают возможность масштабирования и поддержки кода в будущем. ",
            "Обновления помогают большинству веб-приложений стать более мощными и производительными, что расширяет возможности для создания инновационных и уникальных приложений на основе JavaScript.",
            "Вот, какие функции были добавлены в ECMAScript в 2023 году."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "1. Поиск элемента в массиве",
          "paragraphs": [
            "Эта функция позволяет найти последний элемент массива, соответствующий заданному условию."
          ]
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const array = [{a: 1, b: 1}, {a: 2, b: 2}, {a: 3, b: 3}, {a: 4, b: 4}] \n console.log(array.findLast(n => n)); //result -> {a: 4,b: 4 } \n console.log(array.findLast(n => n.a * 5 === 20)); // result -> {a:4,b:4} as the condition is true so it returns the last element. \n console.log(array.findLast(n => n.a * 5 === 21)); //result -> undefined as the condition is false so return undefined instead of {a:4,b:4}. \n console.log(array.findLastIndex(n => n.a * 5 === 21)); // result -> -1 as the condition is not justified for returning the last element. /n console.log(array.findLastIndex(n => n.a * 5 === 20)); // result -> 3 which is the index of the last element as the condition is true."
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "2. Грамматика Hashbang",
          "paragraphs": [
            "Эта функция позволит нам использовать Hashbang/Shebang в некоторых CLI.",
            "Shebang представлен #! и представляет собой специальную строку в начале скрипта, которая сообщает операционной системе, какой интерпретатор использовать при выполнении скрипта."
          ]
        },
        {
          "id": "5",
          "type": "CODE",
          "code": "#!/usr/bin/env node \n // in the Script Goal \n  'use strict'; \n console.log(2*3); \n #!/usr/bin/env node \n // in the Module Goal \n export {}; \n console.log(2*2);"
        }
      ]
    },
    {
      "id": "2",
      "title": "React: революция использования фигурных скобочек",
      "subtitle": "В этот раз Александр размышляет о том, как простые и понятные привычки можно переосмыслить и пофиксить фигурными скобочками. Бонус: смешная панда, которая задает много вопросов и вечно чем-то недовольна.",
      "img": "https://sun9-53.userapi.com/impg/eW-24xFtX4ETG9YY3qVJKN315Y2Xr2POgb9gMw/mTNAKCMZlHc.jpg?size=912x512&quality=96&sign=c0cf6056a4a7e8ffbeb75593b95edd11&c_uniq_tag=kWMDJwtKfcOtaC3MNBHcNAcJkKZnyz8TzR20JaXRslo&type=album",
      "views": 7800,
      "createdAt": "10 May 2023",
      "userId": "4",
      "type": [
        "IT",
        "Frontend",
        "React"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Вступление",
          "paragraphs": [
            "Хорошо, react. Как много мы используем всего, потому что так исторически сложилось: пишем функции задом наперед (сначала объяви, потом вызывай). Оборачиваем все в стрелочные функции и константы с ними, когда достаточно именованной функции. Этот список можно хорошенько продолжить",
            "В этой статье хотелось бы обсудить несколько привычек, которые есть у нас всех и которые, возможно, пора переосмыслить."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Начнем с кастомных хуков, которым надо вернуть результат, в частности пару значений. Классическим примером может быть хук для запроса данных по сети и отслеживания в процессе ли этот запрос сейчас, чтобы добавить на страницу лоадер."
          ]
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "function useClient(clientId) { \n  const [loadedClient, setLoadedClient] = useState(null) \n  const [isLoading, setIsLoading] = useState(false) \n\n  useEffect(() => { \n  const loadClient = async () => { \n  try { \n  setIsLoading(true) \n  const clientData = {} // actual data loading call goes here \n  setLoadedClient(clientData) \n } \n  finally { \n  setIsLoading(false) \n } \n } \n\n loadClient() \n }, [clientId]) \n\n return [loadedClient, isLoading] \n }"
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "В итоге вызываем его вот как-то так:"
          ]
        },
        {
          "id": "5",
          "type": "CODE",
          "code": "const [loadedClient, isLoading] = useClient(clientId)"
        },
        {
          "id": "6",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "А может вот так:"
          ]
        },
        {
          "id": "7",
          "type": "CODE",
          "code": "const [client, isClientLoading] = useClient(clientId)"
        },
        {
          "id": "8",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Кажется, что тут мы руководствуемся паттерном от useState, когда он возвращает нам массив из значения и функции для его обновления, а мы потом деструктурируем массив и получаем все по индексу, даем этому любые имена, круто."
          ]
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Почему для useState пришлось сделать именно так?",
          "paragraphs": [
            "Потому, что это библиотечная универсальная функция. Клиенты вызывают её в своих конкретных случаях и хотят давать разные, полезные, говорящие имена."
          ]
        },
        {
          "id": "10",
          "type": "TEXT",
          "title": "Что же выходит с нашим кастомных хуком useClient?",
          "paragraphs": [
            "Мы следуем чьей-то конвенции, потому что все так делают, а значит это react way и все в таком духе",
            "Но нужна ли нам эта гибкость в плане именования результатов работы этой функции? А если у нас нет TypeScript, то кто поможет заподозрить неладное? А если искать все использования полным поиском по проекту без использования полезных фишек IDE, то много ли мы найдем, если каждый называет как хочет?",
            "Продолжение следует..."
          ]
        }
      ]
    },
    {
      "id": "3",
      "title": "Почему Data Science не для вас?",
      "subtitle": "Много раз видели рекламу, на которой вас активно зазывали на курсы по Data Science и обещали золотые горы через несколько месяцев обучения? Наш аналитик данных Мария выразила своё мнение по этому поводу этого...",
      "img": "https://insidebigdata.com/wp-content/uploads/2019/04/DataScience_shutterstock_1054542323.jpg",
      "views": 9200,
      "createdAt": "20 Mar 2023",
      "userId": "4",
      "type": [
        "IT",
        "Big Data",
        "Data Engineering"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "IMAGE",
          "src": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/2bb/b2b/7c9/2bbb2b7c920bfc76c0109b41f8035adc.png",
          "title": ""
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Data Science сейчас во многом благодаря активному маркетингу становится очень популярной темой. Быть датасаентистом – модно и, как говорят многие рекламки, которые часто попадаются на глаза, не так уж и сложно. Ходят слухи, что работодатели стоят в очереди за возможность взять человека с курсов. Получить оффер на работу крайне легко, ведь в ваши обязанности будет входить требование данных от заказчика (как обычно говорят, чем больше данных – тем лучше) и закидывать их в искусственный интеллект, который работает по принципу черного ящика. Кстати, еще и платят немереное количество денег за всё это.",
            "В этой душераздирающей статье решили попробовать отговорить людей, которые готовы оставить кучу денег за курсы по Data Science, браться за это дело, а может быть и помочь определиться с тем, что на самом деле стоит сделать, чтобы встать на путь истинный."
          ]
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Почему всё-таки Data Science не для вас?",
          "paragraphs": [
            "1. Data Science – для усидчивых. Над одной и той же задачей придется сидеть очень долго. Пока найдешь все необходимое в данных, пока найдешь оптимальный способ обработки данных, пока погрузишься в область, пока переберешь все модельки, которые могут потенциально хорошо решить эту задачу… А еще надо дождаться, пока модель обучится - это ж целая вечность пройдет! Потом еще выясняется, что у модели метрики недостаточно хорошие, и весь этот путь нужно пройти заново, но с новыми идеями.",
            "Хватит ли вам умения занять себя другими делами во время обучения модели? Вряд ли проджект будет в восторге, если узнает, что несколько дней вы пили кофе, пока модель обучалась. Хватит ли вам терпения перебирать идеи до тех пор, пока точность модели не достигнет нужного бизнесу числа?",
            "2. Математика останавливается не на 2+2 и даже не на интегралах. Вам точно понадобятся знания по мат.статистике, линейной алгебре, теории вероятностей. Нет, вам не хватит встроенных в библиотечки функций. Может быть для какого-то поверхностного анализа и составления простецкой модели – да, но чтобы лучше анализировать огромные массивы данных, в математике действительно нужно разбираться.",
            "3. Вам нужно знать Python/R/Scala или еще что-то, на чем вы соберете ваше решение. Вы не бэкенд-разработчик, но вам нужно приготовить умную штуку, которую можно будет встроить в прод. Нужно будет составлять POC-шки, функции предобработки данных, которые затем будет имплементировать бэкенд-разраб. Необходимо уметь общаться с бэкендерами на их языке, если им понадобится помощь при внедрении вашего решения",
            "4. Еще немного о встраивании модели в прод: вам нужно интересоваться тем, на каком железе будет запущена модель. Ну не получится запустить трансформер на сервачке заказчика с двумя ядрами и без малейшего признака GPU. А решение, которое работает на вашем компе и не работает на устройствах клиента не будет принято и, соответственно, оплачено."
          ]
        }
      ]
    },
    {
      "id": "4",
      "title": "Ретроспектива, почему так важно обращаться в прошлое?",
      "subtitle": "Наша project-менеджер Юлия поготовила статью о том, что такое Ретроспектива и в чём её ценность",
      "img": "https://i.pinimg.com/originals/c1/e5/66/c1e56684c99e47a5d15eee18d3d1ecd9.jpg",
      "views": 483,
      "createdAt": "1 Nov 2023",
      "userId": "4",
      "type": [
        "IT",
        "Communication"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Вступление",
          "paragraphs": [
            "«До того как я начала работать в IT-компании слово “ретроспектива” у меня ассоциировалось с афишей кино, которая приглашает в течение месяца посмотреть все фильмы одного режиссера. Смысл таких мероприятий в том, чтобы проследить развитие творческого пути режиссера, его сюжетов и в целом взглядов на жизнь; вместе поностальгировать, посмеяться, поплакать и сделать выводы.",
            "Ретроспектива в IT имеет тот же смысл. Команда проекта оглядывается в прошлое, формирует общую картину происходящего с помощью своих эмоций и пытается понять как нужно действовать в будущем»"
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Как работает команда в IT",
          "paragraphs": [
            "У любых проектов в нашем мире есть установленные сроки, IT-проекты не исключение. Чтобы не терять тонус на пути приближения к дедлайну (который всегда кажется далеким) проектная команда в IT работает “спринтами” - небольшими временными промежутками, к концу которых она должна добиться оговоренных результатов. В нашей компании спринт длится одну рабочую неделю.",
            "То есть цели ставятся перед командой каждую неделю и уже к концу недели она должна их достичь. Темп довольно напряженный. Стоит отметить, что после планирования люди не разбегаются по компьютерам писать свои кусочки кода целую неделю (и не приходят в пятницу со словами “Я сделяль”). Всю неделю члены команды уточняют требования к задачам, проводят мозговые штурмы по поводу внезапно возникших багов, пытаются их устранить, обсуждают дизайн, доделывают задачи с прошлого спринта, более опытные коллеги помогают менее опытным, менее опытные коллеги на ходу изучают особенности технологий, которыми они пользуются. В общем происходит постоянное взаимодействие всех и вся.",
            "За неделю люди успевают накопить узелок разнообразных эмоций. Примерно таких же разнообразных, как от просмотра мультфильма Юрия Норштейна “Ёжик в тумане”. Где узелок, там и туман, в который хочется уйти. Ретроспектива помогает немного рассеять туман и выйти к свету."
          ]
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Как проходит ретроспектива",
          "paragraphs": [
            "На ретроспективу выделяется 1-2 часа в конце спринта. Команда собирается вместе и обсуждает как прошла неделя. Цель мероприятия не просто обсудить закрыты задачи за спринт или нет. Иначе что обсуждать, если всё сделано? Каждый член команды высказывает своё личное мнение о событиях прошедшей недели, делится своими впечатлениями.",
            "Речь может идти о чем угодно: о задачах, об ошибках, о личных переживаниях по поводу проекта, о своих результатах и результатах коллег, о процессах, о требованиях, об общении в команде – в общем, обо всём что касается проекта. Главная цель команды - сосредоточиться на эмоциях друг друга, понять откуда они возникли и всем вместе прийти к выводам каким образом дальше строить свою работу.",
            "Для удобства восприятия используется доска (настоящая или виртуальная), на которой люди записывают всё о чем хотят поговорить относя свои карточки в необходимые категории. Классическая доска в нашей компании состоит из четырех столбцов: “Что было хорошо?”, “Что было плохо?”, “Что можно улучшить?”, “Чему научился?”. Доска заполняется в первые 10 минут ретроспективы и далее следует обсуждение каждого мнения."
          ]
        },
        {
          "id": "4",
          "type": "IMAGE",
          "src": "https://sun9-58.userapi.com/impg/pQKB1QCih7CYpJxt_DIojJvAUFLgH4IhveEmnA/9S6yZbxC2ZI.jpg?size=807x457&quality=95&sign=add3a139fe027e2346f1e44cbed586b0&type=album",
          "title": "Пример ретро-доски в Tourmaline Core"
        }
      ]
    },
    {
      "id": "5",
      "title": "Как использовать Nvidia Tesla A10 на рабочем сервере",
      "subtitle": "Для нашей небольшой ML-команды назревал проект, на котором неплохо было бы использовать мощности какой-нибудь видеокарты. Выбор пал на Nvidia Tesla a10...",
      "img": "https://www.nvidia.com/content/dam/en-zz/Solutions/gtcs21/a10/og-new/nvidia-a10-og.jpg",
      "views": 2400,
      "createdAt": "22 Aug 2022",
      "userId": "4",
      "type": [
        "IT",
        "DevOps"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Nvidia Tesla a10",
          "paragraphs": [
            "Nvidia Tesla a10 – отличное решение для проведения экспериментов небольшой командой, специализирующейся на машинном обучении, если вы не работаете с огромными массивами данных. И в целом иметь свое устройство для задач по искусственному интеллекту (и не только), всегда интереснее, чем арендовать чужое.",
            "Хотя эта видеокарта отлично справляется со своими задачами, но все же имеет 2 проблемы:",
            "1. Подключение требует некоторой настройки в BIOS вашей материнской платы;",
            "2. Нет активного охлаждения. Связано это, в первую очередь, с тем, что она предназначена для серверов с хорошим кондиционированным воздухом. Поэтому придется решить проблему охлаждения, иначе видеокарта будет быстро достигать значения температуры, при которой она начнет тротлить."
          ]
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Настройка системы для видеокарты",
          "paragraphs": [
            "У видеокарты Tesla A10 24 гб оперативной памяти. Для видеокарт, чья память превышает 16 гб, необходимо в BIOS материнской платы установить флаг “enabled” у опции “memory mapped I/O above 4GB”, “above 4GB decoding” или “PCI 64 bit resource handling above 4GB”. Примерно одно из таких названий будет у вас около этой опции.",
            "Далее остается только установить драйвера для видеокарты. Сделать на Ubuntu 20.04 это можно так:"
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "apt install libnvidia-common-470 \n apt install libnvidia-gl-470 \n apt install nvidia-driver-470"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Возможно, необходимо будет перезагрузить сервер.",
            "Далее при вводе команды nvidia-smi, вы должны увидеть окно с описанием ресурсов видеокарты"
          ]
        },
        {
          "id": "6",
          "type": "IMAGE",
          "src": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/cd6/f08/d31/cd6f08d31c0f6237e0d076de83afc133.png",
          "title": "nvidia-smi"
        }
      ]
    },
    {
      "id": "6",
      "title": "Как оценивать задачи и подружиться с дедлайнами",
      "subtitle": "В этой статье Маргарита делится своим опытом, набитыми шишками и успешными практиками, и разбирается, что нужно учесть при оценке времени выполнения задачи.",
      "img": "https://u2.9111s.ru/uploads/202303/30/91311fd13c1c6e4f7f845b88022ddd9d.jpg",
      "views": 7800,
      "createdAt": "22 Jun 2023",
      "userId": "4",
      "type": [
        "Web Design"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Вступление",
          "paragraphs": [
            "Правильная оценка задач - один из важных аспектов, определяющих успех в работе над проектом.",
            "Всем привет! Меня зовут Маргарита, я UI/UX дизайнер в компании Tourmaline Core. В этой статье решила поделиться своим опытом, набитыми шишками и успешными практиками, и разобраться, что нужно учесть при оценке времени выполнения задачи.",
            "Статья будет полезна как начинающим дизайнерам, так и другим специалистам, сталкивающимся с горящими дедлайнами и проблемами в оценке задач."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Выполнение задачи на время",
          "paragraphs": [
            "В начале своего дизайнерского пути я столкнулась с трудностью оценки новых задач, с которыми раньше у меня не было опыта. Я не могла приблизительно определить, сколько времени займет выполнение этих активностей. В то время я нашла для себя небольшую хитрость, которая помогла мне справиться с этой проблемой.",
            "Представим, что нашему дизайнеру необходимо оценить время, требуемое на создание дизайна формы на сайте, но у него нет опыта работы с формами. Хитрость заключается в том, чтобы засечь время и сделать маленькую часть задачи, например, дизайн одной кнопки. Так ему будет легче понять, сколько времени затрачивается на эту маленькую часть работы. А из таких частей и состоит вся форма.",
            "Иногда задача может быть гораздо сложнее приведенного выше примера, а времени на попытку реализовать ее нет. В таком случае полезно представить последовательность шагов, по которым будет выполняться задача, и подумать, может ли где-то возникнуть непредвиденная проблема, сделать дополнительный ресерч. Также полезно провести аналогию с похожими задачами и вспомнить, сколько времени они обычно занимали."
          ]
        },
        {
          "id": "3",
          "type": "IMAGE",
          "src": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/3d2/e5a/137/3d2e5a137a269465d89477980b4d1614.png",
          "title": ""
        }
      ]
    },
    {
      "id": "7",
      "title": "E2E-тестирование подключения по WalletConnect между DApp",
      "subtitle": "Тестируем подключение по WalletConnect между DApp и мобильным приложением Metamask. О сложностях и их преодолении рассказал в статье главный по багам в Tourmaline Илья.",
      "img": "https://sun9-19.userapi.com/impg/lmW5Qn5N74ZuKTyCEH8Vy7QXMmH_09xixFtufA/loYT8aUwFaQ.jpg?size=807x807&quality=96&sign=c1ac78d4a0021f00caddad38e893bac5&c_uniq_tag=bEG4bCNNCMIclhB7cghFGfsbDOWQz63p8-ovxGgBra4&type=album",
      "views": 2600,
      "createdAt": "16 Okt 2020",
      "userId": "4",
      "type": [
        "IT",
        "Tests"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Тестирование приложений через сквозные (end-to-end) тесты сейчас довольно популярно. Этот вид тестирования позволяет оценить работоспособность приложения со стороны пользователя. Поэтому компания, в которой я работаю, внедряет этот вид тестирования в проекты.",
            "Летом 2022 года мы разрабатывали блокчейн приложение. Моя задача заключалась в проведении E2E тестирования DApp [Децентрализованное приложение — приложение, которое базируется на технологии блокчейн совместно с механизмом распределенного выполнения необходимых инструкций]. Но мы столкнулись с проблемой — готовых решений для проведения end-to-end тестирования DApp под нашу конкретную задачу не было. Эта статья о том, как мы решали эту проблему."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/5fe/8bc/7e6/5fe8bc7e6b30c284aa1882040af7eea3.png",
          "title": ""
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Всем привет! Меня зовут Илья. Я QA-engineer в компании Tourmaline Core. Я занимаюсь налаживанием процессов тестирования на всех уровнях. В этой статье хочу рассказать с какими проблемами я столкнулся на одном из проектов, как решал их и какой результат получил.",
            "Задачей проекта, над которым мы работали, была разработка Telegram-бота для взаимодействия с Gnosis Safe. Gnosis Safe  является безопасным способом управления криптовалютными средствами. Также, Gnosis Safe — это система, позволяющая создавать DAO (децентрализованная автономная организация). Сервис позволяет ее участникам управлять организацией с помощью proposal (предложений), где выполнение каждого пропозала определяется коллективным голосованием, без центрального органа управления. Так, любой пользователь внутри данной системы может создать пропозал на добавление нового участника DAO или выполнения метода смарт-контракта, за который голосуют другие участники DAO. Когда количество проголосовавших переходит некий порог, то в блокчейне создается и выполняется транзакция. Бот состоит из Web App, а для обработки полученных команд разработан API и настроена интеграция с мобильным приложением Metamask при помощи WalletConnect. Приложение Metamask используется для подтверждения или отклонения транзакции, а WalletConnect обеспечивает подключение нашего приложения к криптокошельку."
          ]
        }
      ]
    }
  ],
  "users": [
    {
      "id": "1",
      "username": "admin",
      "password": "admin",
      "role": "ADMIN",
      "avatar": "https://cdn.jsdelivr.net/gh/alohe/memojis/png/memo_34.png"
    },
    {
      "id": "2",
      "username": "Adam Denisov",
      "password": "123",
      "role": "USER",
      "avatar": "https://cdn.jsdelivr.net/gh/alohe/memojis/png/memo_23.png"
    },
    {
      "id": "3",
      "username": "Abbie Wilson",
      "password": "123",
      "role": "USER",
      "avatar": "https://cdn.jsdelivr.net/gh/alohe/memojis/png/memo_31.png"
    },
    {
      "id": "4",
      "username": "TourmalineCore",
      "password": "123",
      "role": "USER",
      "avatar": "https://sun9-74.userapi.com/impg/rDNpAVdecXSKf57ngdP96WmhYnU3o2nbxkUJxQ/GPbX3FHYybs.jpg?size=1300x1300&quality=95&sign=77a223ae095c9aac66ccf33f1b21cb8d&type=album"
    }
  ],
  "profile": [
    {
      "id": "1",
      "firstname": "Artem",
      "lastname": "Shabanov",
      "age": 22,
      "currency": "RUB",
      "country": "Russia",
      "city": "Chelyabinsk",
      "username": "admin",
      "avatar": "https://cdn.jsdelivr.net/gh/alohe/memojis/png/memo_34.png"
    },
    {
      "id": "2",
      "firstname": "Adam",
      "lastname": "Denisov",
      "age": 32,
      "currency": "USD",
      "country": "USA",
      "city": "Miami",
      "username": "Adam Denisov",
      "avatar": "https://cdn.jsdelivr.net/gh/alohe/memojis/png/memo_23.png"
    },
    {
      "id": "3",
      "firstname": "Abbie",
      "lastname": "Wilson",
      "age": 22,
      "currency": "EUR",
      "country": "Italy",
      "city": "Rome",
      "username": "Abbie Wilson",
      "avatar": "https://cdn.jsdelivr.net/gh/alohe/memojis/png/memo_31.png"
    },
    {
      "id": "4",
      "firstname": "Tourmaline",
      "lastname": "Core",
      "age": 22,
      "currency": "EUR",
      "country": "Italy",
      "city": "Rome",
      "username": "TourmalineCore",
      "avatar": "https://sun9-74.userapi.com/impg/rDNpAVdecXSKf57ngdP96WmhYnU3o2nbxkUJxQ/GPbX3FHYybs.jpg?size=1300x1300&quality=95&sign=77a223ae095c9aac66ccf33f1b21cb8d&type=album"
    }
  ]
}